src/cf/DataProcessors/TestPutMethod.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>TestPutMethod</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>tokenKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>orderCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>customMerchantId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>currency</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>orderDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>totalItem</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>checkoutType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>installment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>month</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>bankCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>paymentMethod</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>returnUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>buyerName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>buyerEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>buyerPhone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>buyerAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>buyerCity</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>buyerCountry</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>paymentHours</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>promotionCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/DayCare.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>DayCare</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>DogSize</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogSizes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Staff</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Package</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Packages</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PackageTime</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PackageTimes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Pickup</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>City</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>District</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ward</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Street</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AddressNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PickupTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Dog</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogOwners</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CheckIn</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CheckOut</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Driver</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Drivers</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/TrackingHistory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>TrackingHistory</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Purpose</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Purposes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Dog</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CheckIn</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CheckOut</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Zone</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Zones</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/TestPutMethod/Forms/Form/Ext/Form/Module.bsl
&AtServer
Procedure PutAtServer2()
	// Insert handler content.
	Query = New Query;
	//DogCode = Request.QueryOptions.Get("Code");
	//Dog = Catalogs.Dogs.FindByCode("0000000001");
	Query.SetParameter("Code", "0000000001");
	Query.SetParameter("EmptyValue", Null);
	
	Query.Text = "SELECT
	             |	DogTracking.Ref AS Ref,
	             |	DogTracking.Date AS Date,
	             |	DogTracking.DogOwner AS DogOwner,
	             |	DogTracking.Dog AS Dog,
	             |	DogTracking.EndTime AS EndTime,
	             |	DogTracking.StartTime AS StartTime,
	             |	DogTracking.Purpose AS Purpose,
	             |	DogTracking.Number AS Number
	             |FROM
	             |	Document.DogTracking AS DogTracking
	             |WHERE
	             |	DogTracking.Dog.Code = &Code";
	
	Result = Query.Execute();
	CheckinData = Result.Unload();
	
	For Each Row in CheckinData Do
		If ValueIsFilled(Row.StartTime) And
			Not ValueIsFilled(Row.EndTime) Then
			DocumentObject = Row.Ref.GetObject();
			DocumentObject.EndTime = CurrentDate();
			DocumentObject.Write();
		EndIf;
	EndDo;
EndProcedure

&AtServer
Function PutAtServer()
	Code = "000000002";
	
	If Catalogs.Employees.FindByCode(Code) = 
		Catalogs.Employees.EmptyRef() Then
	Else
		//Normal Flow
		Query = New Query;
		Query.Text = "SELECT
		             |	DayCare.Period AS Period,
		             |	DayCare.Dog AS Dog,
		             |	DayCare.Customer AS Customer,
		             |	DayCare.CheckIn AS CheckIn,
		             |	DayCare.CheckOut AS CheckOut,
		             |	DayCare.Staff AS Staff,
		             |	DayCare.Package AS Package,
		             |	DayCare.PackageTime AS PackageTime,
		             |	DayCare.Pickup AS Pickup
		             |FROM
		             |	InformationRegister.DayCare AS DayCare
		             |WHERE
		             |	DayCare.Staff.Code = &Code
		             |	AND DayCare.CheckIn BETWEEN BEGINOFPERIOD(&Date, DAY) AND ENDOFPERIOD(&Date, DAY)";
		
		Query.SetParameter("Code", Code);
		Query.SetParameter("Date", Date);
		
		Result = Query.Execute();
		Selection = Result.Unload();
	EndIf; 
EndFunction

&AtClient
Procedure Put(Command)
	PutAtServer();
EndProcedure

&AtServer
Procedure CheckingStatusCheckAtServer()
Query = New Query;
		
	Query.Text = 
		"SELECT TOP 1
		|	TrackingHistorySliceLast.CheckIn AS CheckIn,
		|	TrackingHistorySliceLast.Dog AS Dog,
		|	TrackingHistorySliceLast.CheckOut AS CheckOut
		|FROM
		|	InformationRegister.TrackingHistory.SliceLast AS TrackingHistorySliceLast
		|WHERE
		|	TrackingHistorySliceLast.Dog = &Dog
		|
		|ORDER BY
		|	CheckIn DESC";
	
	Dog = Catalogs.Dogs.FindByCode("0000000008");
	Query.SetParameter("Dog", Dog);
	
	QueryResult = Query.Execute();
	
	Selection = QueryResult.Select();
	
	Data = New Structure;
	CheckIn = True;
	CheckOut=False;
	TimeCheckIn=Undefined;
	
	While Selection.Next() Do
		If ValueIsFilled(Selection.CheckOut)=False Then
		    CheckIn = False;
			CheckOut = True
			EndIf; 
		Time = String(Selection.CheckIn);
	EndDo;
	Data.Insert("CheckIn",CheckIn);
	Data.Insert("CheckOut",CheckOut);
	Data.Insert("TimeCheckIn",Time);
	//Return Data;
	// Insert handler content.
EndProcedure

&AtClient
Procedure CheckingStatusCheck(Command)
	CheckingStatusCheckAtServer();
EndProcedure

&AtServer
Procedure TestUpdateDocumentAtServer()
	// Insert handler content.
	If FullTextSearch.GetFullTextSearchMode() = FullTextSearchMode.Enable Then
		Documents.DogTracking.GetListForm("ListForm").IsOpen();	
	EndIf;
EndProcedure

&AtClient
Procedure TestUpdateDocument(Command)
	TestUpdateDocumentAtServer();
EndProcedure

&AtServer
Procedure NewWriteProcessingAtServer()
	// Insert handler content.
EndProcedure

&AtClient
Procedure NewWriteProcessing(NewObject, Source, StandardProcessing)
	NewWriteProcessingAtServer();
EndProcedure

&AtServer
Procedure TestBreedAtServer()
	Query = New Query;
	Query.Text = "SELECT
	             |	Dogs.Code AS Code,
	             |	Dogs.DogBreed AS DogBreed,
	             |	1 AS Frequency
	             |FROM
	             |	Catalog.Dogs AS Dogs";
	
	Result = Query.Execute();
	Selection = Result.Unload();
	
	FrequencyList = New ValueTable();
	FrequencyList.Columns.Add("DogBreed",,,);
	FrequencyList.Columns.Add("Frequency",,,);
	
	For Each Row In Selection Do
		If FrequencyList.Find(Row.DogBreed, "DogBreed") <> Undefined Then
			FrequencyList.Find(Row.DogBreed, "DogBreed").Frequency = 
			FrequencyList.Find(Row.DogBreed, "DogBreed").Frequency + 1;
		Else
			NewRow = FrequencyList.Add();
			NewRow.DogBreed = Row.DogBreed;
			NewRow.Frequency = 1;
		EndIf;
	EndDo;
			
EndProcedure

&AtClient
Procedure TestBreed(Command)
	TestBreedAtServer();
EndProcedure

&AtServer
Procedure TestAtServer()
	DogsRef = Catalogs.Dogs.FindByCode(DogCode);
EndProcedure

&AtClient
Procedure Test(Command)
	TestAtServer();
EndProcedure
